#pragma once
/*
Реализвоать подобие минимакс
Сделана первая версия, надо проверить как работает, если все ок, то убрать проверку и поставить DoTurnUnchecked

Сделана функция оценки, надо проверить

сделана тренировка
играют 5 игр
сортируются по очкам
вторая половина заменяется
роляется вероятность
если она прокнула то особь заменяется на новую
иначе заменяется на ребенка двух успешных рандомов

мутация при проке вероятности

добавлен функционал для загрузки / сохранения лучшего/всех особей


надо добавить интерфейс под это 

ВСЕ ТЕСТИТЬ :- )
*/


/*
Что уже сделано:

	1)Реализована структура сети (не тестил)
		LS(40,10,1) Enters = 32
	2)Реализован интерфейс и правила игры в классах Game, GameDlg и  Drawer (протестировано)
*/